; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p5---int100n150-m25---int100c110---s22---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level10 level10)
(sum level0 level13 level13)
(sum level1 level4 level5)
(sum level1 level10 level11)
(sum level1 level13 level14)
(sum level2 level4 level6)
(sum level2 level10 level12)
(sum level2 level13 level15)
(sum level3 level4 level7)
(sum level3 level10 level13)
(sum level3 level13 level16)
(sum level4 level4 level8)
(sum level4 level10 level14)
(sum level4 level13 level17)
(sum level5 level4 level9)
(sum level5 level10 level15)
(sum level5 level13 level18)
(sum level6 level4 level10)
(sum level6 level10 level16)
(sum level6 level13 level19)
(sum level7 level4 level11)
(sum level7 level10 level17)
(sum level7 level13 level20)
(sum level8 level4 level12)
(sum level8 level10 level18)
(sum level8 level13 level21)
(sum level9 level4 level13)
(sum level9 level10 level19)
(sum level9 level13 level22)
(sum level10 level4 level14)
(sum level10 level10 level20)
(sum level10 level13 level23)
(sum level11 level4 level15)
(sum level11 level10 level21)
(sum level11 level13 level24)
(sum level12 level4 level16)
(sum level12 level10 level22)
(sum level12 level13 level25)
(sum level13 level4 level17)
(sum level13 level10 level23)
(sum level14 level4 level18)
(sum level14 level10 level24)
(sum level15 level4 level19)
(sum level15 level10 level25)
(sum level16 level4 level20)
(sum level17 level4 level21)
(sum level18 level4 level22)
(sum level19 level4 level23)
(sum level20 level4 level24)
(sum level21 level4 level25)

(connected l0 l1)
(fuelcost level4 l0 l1)
(connected l0 l2)
(fuelcost level10 l0 l2)
(connected l1 l0)
(fuelcost level4 l1 l0)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l2 l0)
(fuelcost level10 l2 l0)
(connected l2 l1)
(fuelcost level13 l2 l1)

(at t0 l0)
(fuel t0 level18)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l0)
(at p3 l0)
(at p4 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l1)
(at p3 l2)
(at p4 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 5
2. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 5
3. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 5
4. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 5
5. (drive t0 l0 l1 level14 level4 level18)
   deleted: (at t0 l0) (fuel t0 level18)
   added: (at t0 l1) (fuel t0 level14)
   goals met: 0 of 5
6. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 5
7. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 1 of 5
8. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 2 of 5
9. (drive t0 l1 l2 level1 level13 level14)
   deleted: (at t0 l1) (fuel t0 level14)
   added: (at t0 l2) (fuel t0 level1)
   goals met: 2 of 5
10. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 3 of 5
11. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 4 of 5
12. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 5 of 5
